Monard2033/nRF52840-Receiver/src/main.c
/*
 * Copyright (c) 2024 Monard2033
 * SPDX-License-Identifier: Apache-2.0
 *
 * Wireless keyboard receiver:
 *   ESB PRX -> validated keyboard/consumer input -> USB HID reports.
 */

#include <errno.h>
#include <string.h>

#include <esb.h>
#include <nrfx.h>
#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/util.h>
#include <zephyr/usb/class/hid.h>
#include <zephyr/usb/class/usb_hid.h>
#include <zephyr/usb/usb_device.h>

LOG_MODULE_REGISTER(receiver, LOG_LEVEL_INF);

#define INPUT_DATA_SIZE        8U
#define LINK_MAGIC             0xA5U
#define LINK_VERSION           0x03U
#define LINK_TYPE_KEYBOARD     0x01U
#define LINK_TYPE_CONSUMER     0x02U
#define LINK_TYPE_CONTROL      0x03U
#define LINK_TYPE_BATTERY      0x04U
#define LINK_CONTROL_POLL_ACK  0x02U
#define LINK_CONTROL_SESSION_RESET 0x03U
#define LINK_ACK_MAGIC         0x5AU
#define LINK_ACK_TYPE_LOCK_STATE 0x01U
static const uint8_t channel_table[] = { 90U, 95U, 85U };
#define CHANNEL_COUNT          ARRAY_SIZE(channel_table)
static uint8_t current_channel_idx = 0U;
static uint32_t last_packet_rx_uptime_ms = 0U;
#define RX_CHANNEL_TIMEOUT_MS  15U
#define HID_QUEUE_DEPTH        256U
#define HID_REPORT_ID_KEYBOARD 0x01U
#define HID_REPORT_ID_CONSUMER 0x02U
#define HID_REPORT_ID_BATTERY  0x03U
#define HID_REPORT_ID_DFU      0x04U
#define HID_REPORT_ID_TRACE    0x05U
#define HID_FEATURE_PAYLOAD_LEN 8U
#define HID_FEATURE_REPORT_LEN  (1U + HID_FEATURE_PAYLOAD_LEN)
#define DFU_FEATURE_PAYLOAD_LEN 8U
#define DFU_FEATURE_REPORT_LEN  (1U + DFU_FEATURE_PAYLOAD_LEN)
#define TRACE_FEATURE_PAYLOAD_LEN 20U
#define TRACE_FEATURE_REPORT_LEN  (1U + TRACE_FEATURE_PAYLOAD_LEN)
#define TRACE_QUEUE_DEPTH       256U
#define TRACE_CMD_CLEAR         0x01U
#define TRACE_CMD_FREEZE        0x02U
#define TRACE_CMD_RESUME        0x03U
#define BATTERY_VALID_MIN_MV    2800U
#define BATTERY_VALID_MAX_MV    4300U

#define LINK_TYPE_DFU_START     0x10U
#define LINK_TYPE_DFU_DATA      0x11U
#define LINK_TYPE_DFU_FINISH    0x12U
#define LINK_TYPE_DFU_STATUS    0x13U
#define LINK_ACK_TYPE_DFU       0x02U

#define DFU_STATUS_IDLE         0x00U
#define DFU_STATUS_BUSY         0x01U
#define DFU_STATUS_OK           0x02U
#define DFU_STATUS_ERR_SIZE     0x03U
#define DFU_STATUS_ERR_CRC      0x04U
#define DFU_STATUS_ERR_FLASH    0x05U
#define DFU_STATUS_SUCCESS      0x06U

/*
 * This is the on-air packet shared with the transmitter. ESB already adds a
 * CRC, acknowledgement, and retransmissions, so no application CRC is needed.
 */
struct link_input_packet {
	uint8_t magic;
	uint8_t version;
	uint8_t type;
	uint8_t sequence;
	uint8_t data[INPUT_DATA_SIZE];
} __packed;

BUILD_ASSERT(sizeof(struct link_input_packet) == 12U);

struct link_ack_frame {
	uint8_t magic;
	uint8_t version;
	uint8_t type;
	uint8_t sequence;
	uint8_t data[INPUT_DATA_SIZE];
} __packed;

BUILD_ASSERT(sizeof(struct link_ack_frame) == 12U);

enum trace_stage {
	TRACE_STAGE_NONE = 0,
	TRACE_STAGE_ESB_RX = 1,
	TRACE_STAGE_HID_QUEUED = 2,
	TRACE_STAGE_HID_QUEUE_OVERFLOW = 3,
	TRACE_STAGE_DUPLICATE_DROP = 4,
	TRACE_STAGE_SEQUENCE_DROP = 5,
	TRACE_STAGE_USB_NOT_READY_DROP = 6,
	TRACE_STAGE_HID_SUBMIT_OK = 7,
	TRACE_STAGE_HID_SUBMIT_BUSY = 8,
	TRACE_STAGE_HID_SUBMIT_ERROR = 9,
	TRACE_STAGE_HID_COMPLETE = 10,
};

struct trace_entry {
	uint32_t timestamp_ms;
	uint8_t stage;
	uint8_t packet_type;
	uint8_t sequence;
	int8_t result;
	uint8_t data[INPUT_DATA_SIZE];
} __packed;

BUILD_ASSERT(sizeof(struct trace_entry) == 16U);

K_MSGQ_DEFINE(hid_report_queue, sizeof(struct link_input_packet),
	      HID_QUEUE_DEPTH, sizeof(uint32_t));
static K_SEM_DEFINE(hid_in_idle, 1, 1);

/*
 * Report ID 1 is the normal 8-byte keyboard state. Report ID 2 is one
 * 16-bit Consumer Page usage (Play/Pause, volume, media navigation, etc.).
 */
static const uint8_t hid_report_descriptor[] = {
	0x05, 0x01,       /* Usage Page (Generic Desktop) */
	0x09, 0x06,       /* Usage (Keyboard) */
	0xA1, 0x01,       /* Collection (Application) */
	0x85, HID_REPORT_ID_KEYBOARD,
	0x05, 0x07,       /* Usage Page (Keyboard) */
	0x19, 0xE0,       /* Usage Minimum (Left Control) */
	0x29, 0xE7,       /* Usage Maximum (Right GUI) */
	0x15, 0x00,
	0x25, 0x01,
	0x75, 0x01,
	0x95, 0x08,
	0x81, 0x02,       /* Input (Data, Variable, Absolute) */
	0x75, 0x08,
	0x95, 0x01,
	0x81, 0x03,       /* Input (Constant) */
	0x05, 0x08,       /* Usage Page (LEDs) */
	0x19, 0x01,
	0x29, 0x05,
	0x75, 0x01,
	0x95, 0x05,
	0x91, 0x02,       /* Output (Data, Variable, Absolute) */
	0x75, 0x03,
	0x95, 0x01,
	0x91, 0x03,       /* Output (Constant) */
	0x05, 0x07,
	0x19, 0x00,
	0x29, 0x65,
	0x15, 0x00,
	0x25, 0x65,
	0x75, 0x08,
	0x95, 0x06,
	0x81, 0x00,       /* Input (Data, Array) */
	0xC0,

	0x05, 0x0C,       /* Usage Page (Consumer) */
	0x09, 0x01,       /* Usage (Consumer Control) */
	0xA1, 0x01,
	0x85, HID_REPORT_ID_CONSUMER,
	0x15, 0x00,
	0x26, 0xFF, 0x03,
	0x1A, 0x00, 0x00,
	0x2A, 0xFF, 0x03,
	0x75, 0x10,
	0x95, 0x01,
	0x81, 0x00,       /* Input (Data, Array, Absolute) */
	0xC0,

	/* Vendor-defined cached battery Feature/Input report (ID 3). */
	0x06, 0x00, 0xFF,
	0x09, 0x01,
	0xA1, 0x01,
	0x85, HID_REPORT_ID_BATTERY,
	0x15, 0x00,
	0x26, 0xFF, 0x00,
	0x75, 0x08,
	0x95, HID_FEATURE_PAYLOAD_LEN,
	0x19, 0x01,       /* Usage Minimum (vendor byte 1) */
	0x29, HID_FEATURE_PAYLOAD_LEN,
	0x81, 0x02,
	/* Local Usage items are cleared after each Main item. Repeat the range
	 * for the Feature fields so Windows can validate all eight variables. */
	0x19, 0x01,
	0x29, HID_FEATURE_PAYLOAD_LEN,
	0xB1, 0x02,
	0xC0,

	/* Vendor-defined DFU OTA Control/Data Feature report (ID 4). */
	0x06, 0x01, 0xFF,
	0x09, 0x01,
	0xA1, 0x01,
	0x85, HID_REPORT_ID_DFU,
	0x15, 0x00,
	0x26, 0xFF, 0x00,
	0x75, 0x08,
	0x95, DFU_FEATURE_PAYLOAD_LEN,
	0x19, 0x01,
	0x29, DFU_FEATURE_PAYLOAD_LEN,
	0xB1, 0x02,
	0xC0,

	/* Diagnostic-only, read-on-demand trace record (ID 5). No reports are
	 * emitted autonomously, so this cannot add traffic to the input path. */
	0x06, 0x02, 0xFF,
	0x09, 0x01,
	0xA1, 0x01,
	0x85, HID_REPORT_ID_TRACE,
	0x15, 0x00,
	0x26, 0xFF, 0x00,
	0x75, 0x08,
	0x95, TRACE_FEATURE_PAYLOAD_LEN,
	0x19, 0x01,
	0x29, TRACE_FEATURE_PAYLOAD_LEN,
	0xB1, 0x02,
	0xC0,
};
static const struct device *hid_device;
static atomic_t usb_configured;
static atomic_t usb_suspended;
static atomic_t last_rx_uptime_ms;

