Monard2033/nRF52840-Receiver/src/main.c
static bool receiver_queue_led_ack(void)
{
	struct link_ack_frame ack = {
		.magic = LINK_ACK_MAGIC,
		.version = LINK_VERSION,
		.type = LINK_ACK_TYPE_LOCK_STATE,
	};
	struct esb_payload payload = { 0 };

	k_spinlock_key_t dfu_key = k_spin_lock(&dfu_state_lock);
	if (dfu_ack_active) {
		ack = dfu_pending_ack;
		k_spin_unlock(&dfu_state_lock, dfu_key);
	} else {
		k_spin_unlock(&dfu_state_lock, dfu_key);
		atomic_set(&led_ack_dirty, 0);
		k_spinlock_key_t key = k_spin_lock(&led_state_lock);
		ack.sequence = windows_led_sequence;
		ack.data[0] = windows_led_state;
		ack.data[1] = windows_led_valid ? 0x01U : 0x00U;
		ack.data[2] = windows_led_epoch;
		k_spin_unlock(&led_state_lock, key);
	}

	payload.length = sizeof(ack);
	payload.pipe = 0;
	payload.noack = false;
	memcpy(payload.data, &ack, sizeof(ack));
	bool const queued = esb_write_payload(&payload) == 0;
	if (!queued) {
		/* Preserve both the pending DFU command and the retry request. */
		atomic_set(&led_ack_pending, 1);
	}
	/* OTA diagnostic: prove whether reverse ACK payloads are accepted by
	 * the ESB stack and whether a DFU command is being held. */
	static int64_t diag_last_ack_log;
	int64_t const diag_now = k_uptime_get();
	if (queued || (diag_now - diag_last_ack_log) > 1000) {
		diag_last_ack_log = diag_now;
		LOG_INF("ackq dfu_held=%u queued=%u led=%02x",
			ack.type == LINK_ACK_TYPE_DFU ? 1u : 0u, queued ? 1u : 0u,
			ack.data[0]);
	}
	return queued;
}

static void receiver_ack_task(void)
{
	if (atomic_cas(&led_ack_pending, 1, 0)) {
		(void)receiver_queue_led_ack();
	}
}

static void receiver_reset_input_session(void)
{
	bool const keyboard_was_pressed = previous_keyboard_valid &&
		memcmp(previous_keyboard, (uint8_t[INPUT_DATA_SIZE]){ 0 },
		       INPUT_DATA_SIZE) != 0;
	bool const consumer_was_pressed = previous_consumer_valid &&
		memcmp(previous_consumer, (uint8_t[INPUT_DATA_SIZE]){ 0 },
		       INPUT_DATA_SIZE) != 0;

	previous_keyboard_valid = false;
	previous_consumer_valid = false;
	previous_keyboard_queue_failed = false;
	previous_consumer_queue_failed = false;
	previous_keyboard_sequence = 0U;
	previous_consumer_sequence = 0U;
	memset(previous_keyboard, 0, sizeof(previous_keyboard));
	memset(previous_consumer, 0, sizeof(previous_consumer));

	k_spinlock_key_t key = k_spin_lock(&battery_cache_lock);
	battery_cache_valid = false;
	battery_flags = 0U;
	battery_sequence = 0U;
	battery_last_update_ms = 0U;
	k_spin_unlock(&battery_cache_lock, key);

	/* Release only a state that was actually held in the previous RP2040
	 * session. The first new real frame is then accepted regardless of seq. */
	if (keyboard_was_pressed) {
		struct link_input_packet const release = {
			.magic = LINK_MAGIC,
			.version = LINK_VERSION,
			.type = LINK_TYPE_KEYBOARD,
		};
		(void)queue_hid_report(&release);
	}
	if (consumer_was_pressed) {
		struct link_input_packet const release = {
			.magic = LINK_MAGIC,
			.version = LINK_VERSION,
			.type = LINK_TYPE_CONSUMER,
		};
		(void)queue_hid_report(&release);
	}
}

static void receiver_esb_event_handler(const struct esb_evt *event)
{
	if (event->evt_id != ESB_EVENT_RX_RECEIVED) {
		return;
	}

	while (esb_read_rx_payload(&esb_rx_payload) == 0) {
		struct link_input_packet packet;

		atomic_inc(&radio_packets);
		atomic_set(&radio_last_rssi, esb_rx_payload.rssi);
		if (esb_rx_payload.length != sizeof(packet)) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		memcpy(&packet, esb_rx_payload.data, sizeof(packet));
		atomic_set(&last_rx_uptime_ms, (long)k_uptime_get_32());
		last_packet_rx_uptime_ms = k_uptime_get_32();

		if (packet.magic != LINK_MAGIC || packet.version != LINK_VERSION) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		/* DIAGNOSTIC A/B: skip the per-RX-event re-queue of a pending DFU
		 * command (Gemini-era behavior) while investigating the reverse
		 * ACK path. */
		k_spinlock_key_t pending_key = k_spin_lock(&dfu_state_lock);
		bool const command_pending = dfu_ack_active;
		k_spin_unlock(&dfu_state_lock, pending_key);

		if (atomic_get(&led_ack_dirty) != 0 || command_pending) {
			atomic_set(&led_ack_pending, 1);
		}

		if (packet.type == LINK_TYPE_DFU_STATUS) {
			k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
			dfu_current_status = packet.data[0];
			dfu_status_session = packet.data[1];
			dfu_status_token = packet.data[2];
			dfu_status_detail = packet.data[3];
			dfu_status_value = (uint32_t)packet.data[4] |
				((uint32_t)packet.data[5] << 8) |
				((uint32_t)packet.data[6] << 16) |
				((uint32_t)packet.data[7] << 24);
			if (dfu_ack_active &&
			    packet.data[1] == dfu_pending_ack.data[1] &&
			    packet.data[2] == dfu_pending_ack.sequence) {
				dfu_ack_active = false;
			}
			k_spin_unlock(&dfu_state_lock, key);
			LOG_INF("dfu_status st=%u sess=%u tok=%u val=%u",
				packet.data[0], packet.data[1], packet.data[2],
				(uint32_t)packet.data[4] |
					((uint32_t)packet.data[5] << 8) |
					((uint32_t)packet.data[6] << 16) |
					((uint32_t)packet.data[7] << 24));
			atomic_set(&led_ack_pending, 1);
			continue;
		}

		if (packet.type == LINK_TYPE_BATTERY) {
			if (!battery_packet_is_valid(&packet)) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			battery_cache_update(&packet);
			continue;
		}

		if (packet.type == LINK_TYPE_CONTROL) {
			if (packet.data[0] == LINK_CONTROL_SESSION_RESET) {
				receiver_reset_input_session();
				continue;
			}
			if (packet.data[0] != LINK_CONTROL_POLL_ACK) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			continue;
		}

		trace_record(TRACE_STAGE_ESB_RX, &packet, 0);

		bool *previous_valid = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_valid : &previous_consumer_valid;
		bool *previous_queue_failed = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_queue_failed : &previous_consumer_queue_failed;
		uint8_t *previous_data = packet.type == LINK_TYPE_KEYBOARD ?
			previous_keyboard : previous_consumer;
		uint8_t *previous_sequence = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_sequence : &previous_consumer_sequence;
		bool const same_sequence_retry = *previous_valid &&
			packet.sequence == *previous_sequence && *previous_queue_failed;
		bool const data_changed = !*previous_valid ||
			memcmp(packet.data, previous_data, INPUT_DATA_SIZE) != 0;

