Monard2033/nRF52840-Receiver/src/main.c
		/*
		 * If the payload is identical to the current active state and sequence
		 * has not changed, drop it as an ESB duplicate retransmission.
		 */
		if (!data_changed && packet.sequence == *previous_sequence && !same_sequence_retry) {
			atomic_inc(&radio_duplicates);
			trace_record(TRACE_STAGE_DUPLICATE_DROP, &packet, 0);
			continue;
		}

		/*
		 * Any valid state transition (key press, key release, combo, consumer action)
		 * is immediately accepted and delivered to Windows.
		 */
		if (queue_hid_report(&packet)) {
			trace_record(TRACE_STAGE_HID_QUEUED, &packet, 0);
			*previous_valid = true;
			*previous_sequence = packet.sequence;
			*previous_queue_failed = false;
			memcpy(previous_data, packet.data, INPUT_DATA_SIZE);
		} else {
			*previous_valid = true;
			*previous_sequence = packet.sequence;
			*previous_queue_failed = true;
		}
	}
}

static int esb_initialize(void)
{
	static const uint8_t base_address_0[4] = {
		0xE7, 0xE7, 0xE7, 0xE7
	};
	static const uint8_t base_address_1[4] = {
		0xC2, 0xC2, 0xC2, 0xC2
	};
	static const uint8_t address_prefixes[8] = {
		0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8
	};
	int err;

	esb_config.protocol = ESB_PROTOCOL_ESB_DPL;
	esb_config.mode = ESB_MODE_PRX;
	esb_config.bitrate = ESB_BITRATE_2MBPS;
	esb_config.tx_output_power = ESB_TX_POWER_8DBM;
	esb_config.payload_length = sizeof(struct link_input_packet);
	esb_config.selective_auto_ack = true;
	esb_config.use_fast_ramp_up = true;
	esb_config.event_handler = receiver_esb_event_handler;

	err = esb_init(&esb_config);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_0(base_address_0);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_1(base_address_1);
	if (err != 0) {
		return err;
	}

	err = esb_set_prefixes(address_prefixes, ARRAY_SIZE(address_prefixes));
	if (err != 0) {
		return err;
	}

	err = esb_set_rf_channel(channel_table[current_channel_idx]);
	if (err != 0) {
		return err;
	}

	return esb_start_rx();
}

static uint8_t hid_tx_buffer[1U + INPUT_DATA_SIZE];
static uint8_t battery_feature_report[HID_FEATURE_REPORT_LEN];
static uint8_t trace_feature_report[TRACE_FEATURE_REPORT_LEN];

static void battery_feature_build(uint8_t report[HID_FEATURE_REPORT_LEN])
{
	uint8_t *const payload = &report[1];
	k_spinlock_key_t key = k_spin_lock(&battery_cache_lock);
	uint32_t const age_ms = battery_cache_valid ?
		(k_uptime_get_32() - battery_last_update_ms) : UINT32_MAX;
	uint32_t const age_seconds = age_ms == UINT32_MAX ? 0xFFFFU :
		MIN(age_ms / 1000U, 0xFFFFU);

	report[0] = HID_REPORT_ID_BATTERY;
	payload[0] = battery_percentage;
	payload[1] = battery_state;
	payload[2] = (uint8_t)battery_millivolts;
	payload[3] = (uint8_t)(battery_millivolts >> 8);
	payload[4] = battery_sequence;
	payload[5] = battery_cache_valid ? battery_flags : 0U;
	payload[6] = (uint8_t)age_seconds;
	payload[7] = (uint8_t)(age_seconds >> 8);
	k_spin_unlock(&battery_cache_lock, key);
}

static void trace_feature_build(uint8_t report[TRACE_FEATURE_REPORT_LEN])
{
	struct trace_entry entry = { 0 };
	bool valid = false;
	uint8_t remaining;
	uint8_t overwrites;
	bool frozen;
	k_spinlock_key_t key = k_spin_lock(&trace_lock);

	if (trace_count != 0U) {
		entry = trace_queue[trace_tail];
		trace_tail = (uint16_t)((trace_tail + 1U) % TRACE_QUEUE_DEPTH);
		trace_count--;
		valid = true;
	}
	remaining = (uint8_t)MIN(trace_count, UINT8_MAX);
	overwrites = (uint8_t)MIN(trace_overwrites, UINT8_MAX);
	frozen = trace_frozen;
	k_spin_unlock(&trace_lock, key);

	memset(report, 0, TRACE_FEATURE_REPORT_LEN);
	report[0] = HID_REPORT_ID_TRACE;
	report[1] = 1U; /* Trace protocol version. */
	report[2] = (valid ? 0x01U : 0U) | (frozen ? 0x02U : 0U);
	report[3] = remaining;
	report[4] = overwrites;
	if (valid) {
		memcpy(&report[5], &entry, sizeof(entry));
	}
}

static int hid_get_report(const struct device *dev,
				  struct usb_setup_packet *setup,
				  int32_t *len, uint8_t **data)
{
	ARG_UNUSED(dev);

	uint8_t const report_type = setup->wValue >> 8;
	uint8_t const report_id = setup->wValue & 0xFFU;

	if (report_type == 3U && report_id == HID_REPORT_ID_BATTERY) {
		battery_feature_build(battery_feature_report);
		*data = battery_feature_report;
		*len = sizeof(battery_feature_report);
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_DFU) {
		k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
		dfu_feature_report[0] = HID_REPORT_ID_DFU;
		dfu_feature_report[1] = dfu_current_status;
		dfu_feature_report[2] = dfu_status_session;
		dfu_feature_report[3] = dfu_status_token;
		dfu_feature_report[4] = dfu_status_detail;
		dfu_feature_report[5] = (uint8_t)dfu_status_value;
		dfu_feature_report[6] = (uint8_t)(dfu_status_value >> 8);
		dfu_feature_report[7] = (uint8_t)(dfu_status_value >> 16);
		dfu_feature_report[8] = (uint8_t)(dfu_status_value >> 24);
		k_spin_unlock(&dfu_state_lock, key);
		*data = dfu_feature_report;
		*len = sizeof(dfu_feature_report);
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_TRACE) {
		trace_feature_build(trace_feature_report);
		*data = trace_feature_report;
		*len = sizeof(trace_feature_report);
		return 0;
	}

	return -ENOTSUP;
}

static int hid_set_report(const struct device *dev,
				  struct usb_setup_packet *setup,
				  int32_t *len, uint8_t **data)
{
	ARG_UNUSED(dev);

	uint8_t const report_type = setup->wValue >> 8;
	uint8_t const report_id = setup->wValue & 0xFFU;

	if (report_type == 2U && report_id == HID_REPORT_ID_KEYBOARD &&
	    *len >= 1 && *data != NULL) {
		uint8_t const *const report = *data;
		if (*len >= 2 && report[0] == HID_REPORT_ID_KEYBOARD) {
			receiver_set_led_state(report[1]);
		} else if (*len == 1) {
			receiver_set_led_state(report[0]);
		} else {
			return -EINVAL;
		}
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_DFU &&
	    *len >= 1 && *data != NULL) {
		uint8_t const *const report = *data;
		uint8_t const *payload;
		if (*len >= DFU_FEATURE_REPORT_LEN &&
		    report[0] == HID_REPORT_ID_DFU) {
			payload = &report[1];
		} else if (*len >= DFU_FEATURE_PAYLOAD_LEN) {
			payload = report;
		} else {
			return -EINVAL;
		}
		k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
		if (dfu_ack_active && payload[0] != LINK_TYPE_DFU_START &&
		    dfu_pending_ack.data[1] == payload[1]) {
			bool const duplicate =
				memcmp(dfu_pending_ack.data, payload,
				       INPUT_DATA_SIZE) == 0;
			if (duplicate) {
				k_spin_unlock(&dfu_state_lock, key);
				atomic_set(&led_ack_pending, 1);
				(void)receiver_queue_led_ack();
				return 0;
			}
			k_spin_unlock(&dfu_state_lock, key);
			return -EBUSY;
		}
		dfu_pending_ack.magic = LINK_ACK_MAGIC;
		dfu_pending_ack.version = LINK_VERSION;
		dfu_pending_ack.type = LINK_ACK_TYPE_DFU;
		dfu_pending_ack.sequence = ++dfu_command_sequence;
		memcpy(dfu_pending_ack.data, payload, INPUT_DATA_SIZE);
		LOG_INF("dfu_cmd %02x %02x %02x %02x %02x %02x %02x %02x tok=%u",
			payload[0], payload[1], payload[2], payload[3],
			payload[4], payload[5], payload[6], payload[7],
			dfu_pending_ack.sequence);
		dfu_ack_active = true;
		dfu_current_status = DFU_STATUS_BUSY;
		dfu_status_session = payload[1];
		dfu_status_token = dfu_pending_ack.sequence;
		dfu_status_detail = 0;
		dfu_status_value = 0;
		k_spin_unlock(&dfu_state_lock, key);
		atomic_set(&led_ack_pending, 1);
		(void)receiver_queue_led_ack();
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_BATTERY) {
		/* Cached telemetry only. Battery polling must not create reverse ACK
		 * traffic on the keyboard hot path. */
		return 0;
	}

	if (report_type == 3U && report_id == HID_REPORT_ID_TRACE &&
	    *len >= 1 && *data != NULL) {
		uint8_t const *const report = *data;
		uint8_t const command = (*len >= TRACE_FEATURE_REPORT_LEN &&
			report[0] == HID_REPORT_ID_TRACE) ? report[1] : report[0];
		k_spinlock_key_t key = k_spin_lock(&trace_lock);
		switch (command) {
		case TRACE_CMD_CLEAR:
			trace_head = 0U;
			trace_tail = 0U;
			trace_count = 0U;
			trace_overwrites = 0U;
			break;
		case TRACE_CMD_FREEZE:
			trace_frozen = true;
			break;
		case TRACE_CMD_RESUME:
			trace_frozen = false;
			break;
		default:
			k_spin_unlock(&trace_lock, key);
			return -EINVAL;
		}
		k_spin_unlock(&trace_lock, key);
		return 0;
	}

	return -ENOTSUP;
}

static void hid_int_in_ready(const struct device *dev)
{
	ARG_UNUSED(dev);
	trace_record_inflight_complete();
	k_sem_give(&hid_in_idle);
}

static void hid_int_out_ready(const struct device *dev)
{
	uint8_t report[INPUT_DATA_SIZE] = { 0 };
	uint32_t report_len = 0;

