Monard2033/nRF52840-Receiver/src/main.c
	if (hid_int_ep_read(dev, report, sizeof(report), &report_len) != 0 ||
	    report_len == 0) {
		return;
	}

	/* Report protocol carries ID 1; boot protocol sends the one-byte LED
	 * payload without a report ID. Use the length to disambiguate LED bit 0x01
	 * from report ID 1. */
	uint32_t const offset = report_len >= 2U &&
		report[0] == HID_REPORT_ID_KEYBOARD ? 1U : 0U;
	if (report_len > offset) {
		receiver_set_led_state(report[offset]);
	}
}

static const struct hid_ops hid_ops = {
	.get_report = hid_get_report,
	.set_report = hid_set_report,
	.int_in_ready = hid_int_in_ready,
	.int_out_ready = hid_int_out_ready,
};

static void usb_status_callback(enum usb_dc_status_code status,
				const uint8_t *param)
{
	ARG_UNUSED(param);

	switch (status) {
	case USB_DC_CONFIGURED:
		atomic_set(&usb_configured, 1);
		atomic_set(&usb_suspended, 0);
		break;
	case USB_DC_SUSPEND:
		atomic_set(&usb_suspended, 1);
		/* Release a sender if the host suspends with an IN pending. */
		k_sem_reset(&hid_in_idle);
		k_sem_give(&hid_in_idle);
		break;
	case USB_DC_RESUME:
		atomic_set(&usb_suspended, 0);
		break;
	case USB_DC_RESET:
	case USB_DC_DISCONNECTED:
		atomic_set(&usb_configured, 0);
		atomic_set(&usb_suspended, 0);
		/* Release a sender if the endpoint disappeared. */
		k_sem_reset(&hid_in_idle);
		k_sem_give(&hid_in_idle);
		break;
	default:
		break;
	}
}

static bool usb_hid_ready(void)
{
	return atomic_get(&usb_configured) != 0 &&
	       atomic_get(&usb_suspended) == 0;
}

static int send_hid_report(const uint8_t *report, size_t report_size,
			   const struct link_input_packet *trace_packet)
{
	if (!usb_hid_ready()) {
		return -ENOTCONN;
	}
	if (report_size > sizeof(hid_tx_buffer)) {
		return -EMSGSIZE;
	}
	if (k_sem_take(&hid_in_idle, K_NO_WAIT) != 0) {
		return -EBUSY;
	}

	trace_inflight_prepare(trace_packet);
	memcpy(hid_tx_buffer, report, report_size);
	int const err = hid_int_ep_write(hid_device, hid_tx_buffer,
					 report_size, NULL);
	if (err != 0) {
		trace_inflight_cancel();
		k_sem_give(&hid_in_idle);
		atomic_inc(&hid_write_errors);
		return err;
	}

	trace_record(TRACE_STAGE_HID_SUBMIT_OK, trace_packet, 0);
	atomic_inc(&hid_reports_sent);
	return 0;
}

static int send_keyboard_report(const struct link_input_packet *packet)
{
	uint8_t report[1U + INPUT_DATA_SIZE];

	report[0] = HID_REPORT_ID_KEYBOARD;
	memcpy(&report[1], packet->data, INPUT_DATA_SIZE);
	return send_hid_report(report, sizeof(report), packet);
}

static int send_consumer_report(const struct link_input_packet *packet)
{
	const uint8_t report[] = {
		HID_REPORT_ID_CONSUMER,
		packet->data[0],
		packet->data[1],
	};

	return send_hid_report(report, sizeof(report), packet);
}

static int usb_hid_initialize(void)
{
	int err;

	hid_device = device_get_binding("HID_0");
	if (hid_device == NULL) {
		return -ENODEV;
	}

	usb_hid_register_device(hid_device, hid_report_descriptor,
				sizeof(hid_report_descriptor), &hid_ops);

	err = usb_hid_init(hid_device);
	if (err != 0) {
		return err;
	}

	return usb_enable(usb_status_callback);
}

#if CONFIG_LOG
static void status_thread(void)
{
	for (;;) {
		k_sleep(K_SECONDS(5));
		LOG_INF("USB=%s ESB=%s init_err=%ld radio=%ld rssi=%ld bad=%ld dup=%ld "
			"queue_drop=%ld HID=%ld err=%ld "
			"RF[state=%lu cfg_ch=%u reg_ch=%lu mode=%lu pipes=0x%02lx] "
			"HF=0x%08lx",
			usb_hid_ready() ? "ready" : "offline",
			atomic_get(&radio_ready) != 0 ? "ready" : "offline",
			(long)atomic_get(&radio_init_error),
			(long)atomic_get(&radio_packets),
			(long)atomic_get(&radio_last_rssi),
			(long)atomic_get(&radio_bad_packets),
			(long)atomic_get(&radio_duplicates),
			(long)atomic_get(&hid_queue_overruns),
			(long)atomic_get(&hid_reports_sent),
			(long)atomic_get(&hid_write_errors),
			(unsigned long)NRF_RADIO->STATE,
			channel_table[current_channel_idx],
			(unsigned long)NRF_RADIO->FREQUENCY,
			(unsigned long)NRF_RADIO->MODE,
			(unsigned long)NRF_RADIO->RXADDRESSES,
			(unsigned long)NRF_CLOCK->HFCLKSTAT);
	}
}

K_THREAD_DEFINE(status_thread_id, 1024, status_thread,
		NULL, NULL, NULL, 7, 0, 0);
#endif

int main(void)
{
	struct link_input_packet hid_pending = { 0 };
	bool hid_pending_valid = false;
	bool hid_pending_failure_logged = false;
	int err;

	windows_led_epoch = (uint8_t)k_cycle_get_32();

	/*
	 * Enumerate USB first. A radio initialization failure must never make
	 * the HID device disappear from the host.
	 */
	err = usb_hid_initialize();
	if (err != 0) {
		LOG_ERR("USB HID initialization failed: %d", err);
		return err;
	}

	err = esb_initialize();
	if (err != 0) {
		atomic_set(&radio_init_error, err);
		LOG_ERR("ESB initialization failed: %d; USB remains available", err);
	} else {
		atomic_set(&radio_ready, 1);
		LOG_INF("Ready: ESB PRX 2 Mbps channel %u, pipe 0 address "
			"E7:E7E7E7E7, USB keyboard + Consumer Control",
			channel_table[current_channel_idx]);
	}

	for (;;) {
		struct link_input_packet queued;
		receiver_ack_task();

		uint32_t const now_ms = k_uptime_get_32();
		if (atomic_get(&radio_ready) != 0 &&
		    (now_ms - last_packet_rx_uptime_ms) > RX_CHANNEL_TIMEOUT_MS) {
			current_channel_idx = (current_channel_idx + 1U) % (uint8_t)CHANNEL_COUNT;
			(void)esb_set_rf_channel(channel_table[current_channel_idx]);
			last_packet_rx_uptime_ms = now_ms;
		}

		if (!usb_hid_ready()) {
			/*
			 * Retain only keyboard state while the PC is absent. Consumer
			 * actions are transitions and must not be replayed later.
			 */
			while (k_msgq_get(&hid_report_queue, &queued,
					  K_NO_WAIT) == 0) {
				trace_record(TRACE_STAGE_USB_NOT_READY_DROP, &queued,
					     -ENOTCONN);
			}
			hid_pending_valid = false;
			hid_pending_failure_logged = false;
			k_msleep(1);
			continue;
		}

		if (!hid_pending_valid &&
		    k_msgq_get(&hid_report_queue, &queued, K_NO_WAIT) == 0) {
			hid_pending = queued;
			hid_pending_valid = true;
			hid_pending_failure_logged = false;
		}

		if (hid_pending_valid) {
			int const send_result = hid_pending.type == LINK_TYPE_KEYBOARD ?
				send_keyboard_report(&hid_pending) :
				send_consumer_report(&hid_pending);

			if (send_result == 0) {
				hid_pending_valid = false;
				hid_pending_failure_logged = false;
			} else if (!hid_pending_failure_logged) {
				trace_record(send_result == -EBUSY ?
					TRACE_STAGE_HID_SUBMIT_BUSY :
					TRACE_STAGE_HID_SUBMIT_ERROR,
					&hid_pending, send_result);
				hid_pending_failure_logged = true;
			}
		}

		/* No blocking HID wait: let the 1 ms USB endpoint callback release the
		 * idle semaphore while the radio handler remains free to queue input. */
		k_yield();
	}
}
